#                             _ooOoo_
#                            o8888888o
#                            88" . "88
#                            (| -_- |)
#                             O\ = /O
#                         ____/`---'\____
#                       .   ' \\| |// `.
#                        / \\||| : |||// \
#                      / _||||| -:- |||||- \
#                        | | \\\ - /// | |
#                      | \_| ''\---/'' | |
#                       \ .-\__ `-` ___/-. /
#                    ___`. .' /--.--\ `. . __
#                 ."" '< `.___\_<|>_/___.' >'"".
#                | | : `- \`.;`\ _ /`;.`/ - ` : | |
#                  \ \ `-. \_ __\ /__ _/ .-` / /
#          ======`-.____`-.___\_____/___.-`____.-'======
#                             `=---='
#
#          .............................................
#                   佛祖镇楼                  BUG辟易
#           佛曰:
#                   写字楼里写字间，写字间里程序员；
#                   程序人员写程序，又拿程序换酒钱。
#                   酒醒只在网上坐，酒醉还来网下眠；
#                   酒醉酒醒日复日，网上网下年复年。
#                   但愿老死电脑间，不愿鞠躬老板前；
#                   奔驰宝马贵者趣，公交自行程序员。
#                   别人笑我忒疯癫，我笑自己命太贱；
#                   不见满街漂亮妹，哪个归得程序员？
#

# 运算
print(2 + 3)    # 加
print(3 - 1)    # 减
print(2 * 3)    # 乘
print(3 / 2)    # 除
print(2 ** 3)   # 幂等 2的3次方
print(3 % 2)    # 求余
print(5 // 2)   # 取整


# 数据类型
print(type(1))              # <class 'int'>
print(type(1.1))            # <class 'float'>
print(type(1 + 3j))         # <class 'complex'>
print(type('abc'))          # <class 'str'> 单引号或双引号表示字符串, 反斜杠\转义特殊字符
print(type(True))           # <class 'bool'>
print(type(["a", 1]))       # <class 'list'>
print(type(("a", 1)))       # <class 'set'>
print(type({"a", 1}))       # <class 'tuple'>
print(type({"code": 200}))  # <class 'dict'>


